espressif/esp-idf/examples/system/console/advanced_usb_cdc/sdkconfig.defaults
# Build for ESP32-S2 by default
CONFIG_IDF_TARGET="esp32s2"

# Enable USB console
CONFIG_ESP_CONSOLE_USB_CDC=y

# Reduce bootloader log verbosity
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_BOOTLOADER_LOG_LEVEL=2

# Enable FreeRTOS stats formatting functions, needed for 'tasks' command
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y
